---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.FamilyFailures.CannotMakeType
source: html/6c7fac57-c9f8-0066-8b01-9108dbddfed2.htm
---
# Autodesk.Revit.DB.BuiltInFailures.FamilyFailures.CannotMakeType Property

## Syntax (C#)
```csharp
public static FailureDefinitionId CannotMakeType { get; }
```